Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: As for registries, the one for **Prometheus** is part of our Core extensions: `io.quarkus:quarkus-micrometer-registry-prometheus`.
ja_jp: レジストリーに関しては、 **Prometheus** 用のものはCoreエクステンション: `io.quarkus:quarkus-micrometer-registry-prometheus` の一部です。

source: As for the Java Properties format, you can define your own profile:
ja_jp: Javaプロパティ形式については、独自のプロファイルを定義することができます。

source: As for the reactive APIs exposed by Quarkus, stream manipulation uses the Mutiny API.
ja_jp: Quarkusが公開しているリアクティブAPIについては、ストリーム操作にMutiny APIを使用しています。

source: As for the repositories, given that Jakarta Data 1.0 only supports the stateless variants (managed entities are being added to the upcoming 1.1 version), we recommend that you stick to the `PanacheRepository` variants in order to support stateless or managed entities. Both blocking and reactive variants are supported, though.
ja_jp: リポジトリについては、Jakarta Data 1.0 がステートレスなバリアントのみをサポートしているため（マネージドエンティティは次期 1.1 バージョンに追加される予定です）、ステートレスまたはマネージドエンティティをサポートするために `PanacheRepository` バリアントを使用することをお勧めします。ただし、ブロッキングおよびリアクティブの両方のバリアントがサポートされています。

source: As for the server, Quarkus proposes two alternatives for the gRPC clients: gRPC Java and Vert.x. Unlike for the server, you can select the transport for each client:
ja_jp: サーバーに関しては、Quarkus には gRPC クライアント向けに gRPC Java と Vert.x という 2 つの選択肢があります。 サーバーとは異なり、クライアントごとにトランスポートを選択できます。

source: As for the server, you can configure the clients using the centralized TLS configuration or directly.
ja_jp: サーバーに関しては、一元化された TLS 設定を使用するか、直接クライアントを設定できます。

source: As has already been mentioned in the introduction to this section, the main goal of this section is to explain how Quarkus can verify opaque access tokens. In general, propagating access tokens whose only purpose is to allow retrieving `UserInfo` to services should be avoided unless the front-end JAX-RS endpoint or SPA prefers to delegate UserInfo retrieval to the trusted service.
ja_jp: このセクションの冒頭で言及したとおり、このセクションの主な目的は、Quarkus による不透明アクセストークンの検証方法を説明することです。一般的には、フロントエンドの JAX-RS エンドポイントまたは SPA が UserInfo の取得を信頼できるサービスに委譲することを望まない限り、 `UserInfo` の取得を許可することのみを目的とするアクセストークンをサービスに伝播することは回避するべきです。

source: As if the familiar API and the much improved runtime characteristics of the new extension weren't enough, we have added some really exciting and convenient new features (which are not part of the JAX-RS spec) that have either been requested by the community, or are things we feel improve the developer experience and soften some of the spec’s rough edge. These new features are:
ja_jp: おなじみのAPIと、新しいエクステンションの大幅に改善されたランタイム特性だけでは十分ではないかのように、コミュニティからの要望に基づき、あるいは開発者の経験を向上させ、仕様の粗いエッジを和らげてくれると我々が考える、本当にエキサイティングで便利な新機能(JAX-RS仕様の一部ではありません)をいくつか追加しました。これらの新機能は以下の通りです:

source: As in other logs in Quarkus, log levels can be set to xref:logging.adoc#use-log-levels[these values].
ja_jp: Quarkus の他のログと同様に、ログレベルは xref:logging.adoc#use-log-levels[これらの値] に設定可能です。

source: As in the case of an Uber JAR, runtime components in an SBOM generated for an native executable will not include `evidence.occurrences.location` since their corresponding code and resources are included in a single native executable file.
ja_jp: Uber JAR の場合と同様に、ネイティブ実行可能ファイル用に生成された SBOM 内のランタイムコンポーネントに `evidence.occurrences.location` は含まれません。これは、対応するコードとリソースが単一のネイティブ実行可能ファイルに含まれているためです。

source: As indicated in the property name, it uses Vert.x to retrieve the DNS records. By default, it tries to read the first `nameserver` from `/etc/resolv.conf`, if this file exists. You can also configure your DNS server:
ja_jp: プロパティ名で示されているように、Vert.xを使用してDNSレコードを取得します。デフォルトでは、 `/etc/resolv.conf` から最初の `nameserver` を読み取ろうとします。このファイルが存在する場合は、そのファイルを使用します。また、DNS サーバーを設定することもできます。

source: As is described in detail in the <<#openshift, OpenShift>> section, customizing OpenShift (or Knative) properties is done in the same way, but replacing `kubernetes` with `openshift` (or `knative`). The previous example for OpenShift would look like this:
ja_jp: <<#openshift, OpenShift>> のセクションで詳しく説明しているように、OpenShift (または Knative) のプロパティーのカスタマイズは同じ方法で行いますが、 `kubernetes` を `openshift` (または `knative`) に置き換えます。前述の OpenShift の例では、以下のようになります。

source: As is described in detail in the <<#openshift, OpenShift>> section, customizing OpenShift properties is done in the same way, but replacing `kubernetes` with `openshift`. The previous example for OpenShift would look like this:
ja_jp: <<#openshift, OpenShift>> のセクションで詳しく説明しているように、OpenShift プロパティーのカスタマイズは同じ方法で行いますが、 `kubernetes` を `openshift` に置き換えます。前述の OpenShift の例では、以下のようになります。

source: As is described in detail in the xref:openshift[OpenShift] section, customizing OpenShift (or Knative) properties is done in the same way, but replacing `kubernetes` with `openshift` (or `knative`). The previous example for OpenShift would look like this:
ja_jp: xref:openshift[OpenShift] のセクションで詳しく説明されているように、OpenShift（または Knative）のプロパティのカスタマイズは同じ方法で行われますが、 `kubernetes` を `openshift` （または `knative` ）に置き換えます。先ほどのOpenShiftの例では、以下のようになります:

source: As is described in detail in the xref:openshift[OpenShift] section, customizing OpenShift properties is done in the same way, but replacing `kubernetes` with `openshift`. The previous example for OpenShift would look like this:
ja_jp: xref:openshift[OpenShift] のセクションで詳しく説明されているように、OpenShift のプロパティのカスタマイズは同じ方法で行われますが、 `kubernetes` を `openshift` に置き換えます。先ほどのOpenShiftの例では、以下のようになります:

source: As is often the case in the Quarkus world, I was not alone on this journey. I would therefore like to thank everyone who contributed through code, discussions, reviews, insights, and feedback. In alphabetical order: Tamás Cservenák, Sanne Grinovero, Martin Kouba, David Lloyd, Alexey Loubyansky, Matej Novotny, Yoann Rodière, and Ladislav Thon (and if I missed anyone, please let me know!).
ja_jp: Quarkusの世界ではよくあることですが、この道のりにおいて私は一人ではありませんでした。したがって、コード、議論、レビュー、洞察、フィードバックを通じて貢献してくださったすべての方々に感謝したいと思います。アルファベット順に、Tamás Cservenák、Sanne Grinovero、Martin Kouba、David Lloyd、Alexey Loubyansky、Matej Novotny、Yoann Rodière、Ladislav Thon (もし漏れがありましたら、お知らせください！) に感謝します。

source: As is the case with `@NativeImageTest`, this is a black box test that supports the same set features and has the same limitations.
ja_jp: `@NativeImageTest` の場合と同様に、これは同じセットの機能をサポートし、同じ制限があるブラックボックステストです。

source: As is, a Funqy function has a default Cloud Event mapping. By default, the Cloud Event type must match the function name for the function to trigger. If the function returns output, the response is converted into a Cloud Event and returned to the Broker to be routed to other triggers. The default Cloud Event type for this response is the function name + `.output`. The default Cloud Event source is the function name.
ja_jp: この状態で、Funqy関数はデフォルトの Cloud Event マッピングを持っています。デフォルトでは、 Cloud Event のタイプは、トリガする関数の関数名と一致していなければなりません。関数が出力を返す場合、レスポンスは Cloud Event に変換され、ブローカに返されて他のトリガーにルーティングされます。このレスポンスのデフォルトの Cloud Event タイプは、関数名 + `.output` です。デフォルトの Cloud Event のソースは、関数名です。

source: As it turns out, this was a bit of a rabbit hole. Project Leyden delivered results that were far better than expected, and we ended up working with Georgios on integrating it tightly in Quarkus (you can see another blog post coming, right?).
ja_jp: 結局のところ、これはかなり奥の深い話になりました。Project Leyden は期待を大きく上回る結果をもたらし、最終的に Georgios と協力して Quarkus に密接に統合することになりました (別のブログ投稿が続くことが予想できますよね？)。

source: As it uses a dedicated JDBC datasource wrapper, you must enable telemetry for your datasource with the `quarkus.datasource.jdbc.telemetry` property, as in the following example:
ja_jp: 専用の JDBC データソースラッパーを使用するため、以下の例のように `quarkus.datasource.jdbc.telemetry` プロパティーを使用してデータソースのテレメトリーを有効にする必要があります。

source: As it uses a dedicated JDBC datasource wrapper, you must enable telemetry for your datasource:
ja_jp: 専用のJDBCデータソースラッパーを使用するため、データソースのテレメトリーを有効にする必要があります:

source: As it uses a dedicated JDBC driver, you must configure your datasource and Hibernate ORM to use it.
ja_jp: 専用のJDBCドライバを使用するため、データソースとHibernate ORMがそれを使用するように設定する必要があります。

source: As it uses a dedicated JDBC driver, you must configure your datasource and Hibernate to use it.
ja_jp: 専用のJDBCドライバーを使用するため、データソースとHibernateがそれを使用するように設定する必要があります。

source: As long as an Uber-Jar file name is created by appending a suffix, such as `runner`, to the original project JAR file name, the Uber-Jar file name suffix will also be used as the Maven artifact classifier for the Uber-Jar artifact. There are two ways to attach an Uber-Jar as the main project artifact (without the classifier):
ja_jp: Uber-Jar ファイル名が元のプロジェクト JAR ファイル名に `runner` などのサフィックスを付加して作成される限り、Uber-Jar ファイル名のサフィックスは Uber-Jar アーティファクトの Maven アーティファクト分類子としても使用されます。Uber-Jar をメイン・プロジェクト・アーティファクトとして添付するには、2 つの方法があります (分類子なし)：

source: As long as you have one of these extensions in your project, the SSL support will be enabled by default.
ja_jp: これらのエクステンションのいずれかがプロジェクトに含まれている限り、SSLサポートはデフォルトで有効になります。

source: As mandated by the REST Client specification, a default exception mapper is included, that throws an exception when HTTP status code is higher than 400. While this behavior is fine when the client returns a regular object, it is however very unintuitive when the client needs to return a `jakarta.ws.rs.core.Response` (with the intention of allowing the caller to decide how to handle the HTTP status code).
ja_jp: REST Client 仕様で義務付けられているように、HTTP ステータスコードが 400 より大きい場合に例外をスローするデフォルトの例外マッパーが含まれています。 クライアントが通常のオブジェクトを返す場合にはこの動作は問題ありませんが、クライアントが `jakarta.ws.rs.core.Response` を返す必要がある場合には、ほとんど直感的ではありません。 (呼び出し元が HTTP ステータスコードの処理方法を決定できるようにすることを目的としています)。

source: As many of you have heard, the Java community has been rocked by a widespread vulnerability in the Apache Log4J 2 logging library. You can find more details about this vulnerability in https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2021-44228[CVE-2021-44228]
ja_jp: 多くの方がご存知のように、Java コミュニティは、Apache Log4J 2 のロギング・ライブラリに広範な脆弱性が存在することで揺れています。この脆弱性についての詳細は、 https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2021-44228[CVE-2021-44228] に記載されています。

source: As mentioned above Quarkus supports a feature called Dev Services that allows you to create datasources without any config. If you have a database extension that supports it and no config is provided, Quarkus will automatically start a database (either using Testcontainers, or by starting a Java DB in process), and automatically configure a connection to this database.
ja_jp: 前述の通り、QuarkusはDevServicesと呼ばれる機能をサポートしており、設定なしでデータソースを作成することができます。サポートしているデータベースエクステンションがあり、設定が提供されていない場合、Quarkusは自動的にデータベースを起動し（Testcontainersを使用するか、インプロセスのJava DBを起動する）、このデータベースへの接続を自動的に設定します。

source: As mentioned above Quarkus tests are actually full CDI beans, and as such you can apply CDI interceptors as you would normally. As an example, if you want a test method to run within the context of a transaction you can simply apply the `@Transactional` annotation to the method and the transaction interceptor will handle it.
ja_jp: 前述したように、Quarkusのテストは実際には完全なCDI Beanであり、通常のようにCDIインターセプターを適用することができます。例えば、トランザクションのコンテキスト内でテストメソッドを実行したい場合、 `@Transactional` アノテーションをメソッドに適用するだけで、トランザクションインターセプターがそれを処理します。

source: As mentioned above REST Data with Panache supports the `application/json` and `application/hal+json` response content types. Here are a couple of examples of how a response body would look like for the `get` and `list` operations assuming there are five `Person` records in a database.
ja_jp: 前述の通り、REST Data with Panache は `application/json` と `application/hal+json` のレスポンス コンテンツ タイプをサポートしています。 `Person` ここでは、データベース内に `get` レコードが 5 つあると仮定して、 と `list` 操作を行った場合のレスポンスボディがどのようになるか、いくつかの例を示します。

source: As mentioned above, Dev Services for Kafka and Apicurio Registry automatically start and configure a Kafka broker and Apicurio Registry instance in dev mode and for tests. Hence, we don't have to set up Kafka and Apicurio Registry ourselves. We can just focus on writing the test.
ja_jp: 上記のとおり、Dev Services for Kafka と Apicurio Registry は、Kafka ブローカーと Apicurio Registry インスタンスを開発モードおよびテスト用に自動で開始し、設定します。したがって、Kafka および Apicurio Registry を自分で設定する必要はなく、テストの作成に集中できます。

source: As mentioned above, `iat` (issued at), `exp` (expires at), `jti` (token identifier), `iss` (issuer) and `aud` (audience) claims will be added if needed.
ja_jp: 上記のように、必要に応じて、 `iat` (発行日)、 `exp` (有効期限)、 `jti` (トークン識別子)、 `iss` (発行者)、および `aud` (オーディエンス) クレームが追加されます。

source: As mentioned above, in dev and test modes, Quarkus tries to import data by looking for the `src/main/resources/import.redis`. This behavior is disabled in _prod_ mode, and if you want to import even in production, add:
ja_jp: 上記のように、devやtestモードでは、Quarkusは `src/main/resources/import.redis` を探してデータをインポートしようとします。この動作は _prod_ モードでは無効になっており、実稼働環境でもインポートしたい場合は、以下を追加します:

source: As mentioned above, in this guide, we are going to implement a reactive CRUD application. But you may wonder what the differences and benefits are in comparison to the traditional and imperative model.
ja_jp: 前述したように、このガイドでは、リアクティブなCRUDアプリケーションを実装します。しかし、伝統的なモデルや命令型のモデルと比べて、どのような違いや利点があるのか疑問に思うかもしれません。

source: As mentioned above, not everything can run safely on virtual threads. The risk of **monopolization** can lead to high-memory usage. Also, there are situations where the virtual thread cannot be unmounted from the carrier thread. This is called **pinning**. Finally, some libraries use `ThreadLocal` to store and reuse objects. Using virtual threads with these libraries will lead to massive allocation, as the intentionally pooled objects will be instantiated for every (disposable and generally short-lived) virtual thread.
ja_jp: 前述したように、すべてが仮想スレッド上で安全に実行できるわけではありません。 **独占** のリスクはメモリー使用量の多さにつながります。 また、仮想スレッドをキャリアースレッドからアンマウントできない状況もあります。 これは **ピニング** と呼ばれます。 最後に、一部のライブラリーは `ThreadLocal` を使用してオブジェクトを保存し再利用します。 これらのライブラリーで仮想スレッドを使用すると、意図的にプールされたオブジェクトが (使い捨てで一般に短命な) 仮想スレッドごとにインスタンス化されるため、大量の割り当てが発生します。

source: As mentioned above, properties prefixed with `quarkus.` are effectively reserved for configuring Quarkus itself and its extensions. Therefore, the `quarkus.` prefix should **never** be used for application specific properties.
ja_jp: 上述したように、 `quarkus.` で始まるプロパティーは、Quarkus 自体を設定するために実質的に予約されているため、アプリケーション固有のプロパティーのプレフィックスとして `quarkus.` を使用してはいけ *ません* 。

source: As mentioned above, the API is divided into groups:
ja_jp: 前述の通り、API はグループに分かれています。

source: As mentioned above, the JVM schedules the virtual threads. These virtual threads are mounted on carrier threads. The scheduling comes with a pinch of magic. When the virtual thread attempts to use blocking I/O, the JVM _transforms_ this call into a non-blocking one, unmounts the virtual thread, and mounts another virtual thread on the carrier thread. When the I/O completes, the _waiting_ virtual thread becomes eligible again and will be re-mounted on a carrier thread to continue its execution. For the user, all this dance is invisible. Your synchronous code is executed asynchronously.
ja_jp: 前述のように、JVM は仮想スレッドをスケジュールします。これらの仮想スレッドはキャリアースレッドにマウントされます。このスケジューリングには少し魔法のような仕組みがあります。仮想スレッドがブロッキング I/O を使用しようとすると、JVM はこの呼び出しをノンブロッキングの呼び出しに _変換_ し、仮想スレッドをアンマウントして、別の仮想スレッドをキャリアースレッドにマウントします。I/O が完了すると、_待機していた_ 仮想スレッドが再び実行可能な状態になり、再びキャリアースレッドにマウントされて処理を続行します。ユーザーからは、この一連の動作はすべて見えません。同期コードは非同期で実行されます。

source: As mentioned above, the Quarkus application was configured to also start JFR at startup and dump it to a `myrecording.jfr` when it terminates. So we can get the file when we hit `CTRL+C` or type `q` to stop the application.
ja_jp: 前述のように、Quarkus アプリケーションは起動時に JFR も起動し、終了時に `myrecording.jfr` にダンプするように設定されていました。 したがって、 `CTRL+C` を押すか、 `q` と入力してアプリケーションを停止すると、ファイルを取得できます。

source: As mentioned above, the issue is that Quarkus could not determine the `Legume` class, which will require some reflection by analyzing the REST endpoints. The JSON serialization library tries to get the list of fields of `Legume` and gets an empty list, so it does not serialize the fields' data.
ja_jp: 上記のように、問題は Quarkus が REST エンドポイントを分析することで `Legume` クラスが何らかのリフレクションを必要とすることを判断できなかったことです。 JSON シリアライズライブラリーは、`Legume` のフィールドのリストを取得しようとすると空のリストを取得するため、フィールドのデータをシリアライズしません。

source: As mentioned above, the issue is that Quarkus was not able to determine the `Legume` class will require some reflection by analyzing the REST endpoints. The JSON serialization library tries to get the list of fields of `Legume` and gets an empty list so it does not serialize the fields' data.
ja_jp: 上記のように、Quarkusが `Legume` クラスを判断できなかったことが問題となっており、REST エンドポイントを解析して何らかの反映が必要となります。JSONシリアライズライブラリは、 `Legume` のフィールドのリストを取得しようとすると空のリストを取得するので、フィールドのデータをシリアライズしません。

source: As mentioned above, the issue is that Quarkus was not able to determine the `Legume` class will require some reflection by analyzing the REST endpoints. The JSON serialization library tries to get the list of fields of `Legume` and gets an empty list, so it does not serialize the fields' data.
ja_jp: 上記のように、問題は Quarkus が、 REST エンドポイントを分析することで `Legume` クラスが何らかのリフレクションを必要とすることを判断できなかったことです。 JSON シリアライズライブラリーは、 `Legume` のフィールドのリストを取得しようとすると空のリストを取得するため、フィールドのデータをシリアライズしません。

source: As mentioned above, the method can also override the acknowledgment strategy to `PRE_PROCESSING` or `NONE`.
ja_jp: 前述のように、このメソッドは確認応答ストラテジーを `PRE_PROCESSING` または `NONE` にオーバーライドすることも可能です。

source: As mentioned above, virtual threads have a few limitations that can drastically affect your application performance and memory usage. The _junit-virtual-threads_ extension provides a way to detect pinned carrier threads while running your tests. Thus, you can eliminate one of the most prominent limitations or be aware of the problem.
ja_jp: 上述したように、仮想スレッドには、アプリケーションのパフォーマンスとメモリ使用量に大きな影響を与える可能性のあるいくつかの制限があります。 _junit-virtual-threads_ エクステンションは、テストの実行中にピン留めされたキャリアスレッドを検出する方法を提供します。 したがって、最も顕著な制限の1つを解消するか、問題に気づくことができます。

source: As mentioned above, virtual threads have a few limitations that can drastically affect your application performance and memory usage. The _junit5-virtual-threads_ extension provides a way to detect pinned carrier threads while running your tests. Thus, you can eliminate one of the most prominent limitations or be aware of the problem.
ja_jp: 上述したように、仮想スレッドにはいくつかの制限があり、 アプリケーションのパフォーマンスやメモリ使用量に大きな影響を与える可能性があります。 _junit5-virtual-threads_ エクステンションは、テストの実行中にピン留めされたキャリアスレッドを検出する方法を提供します。 このため、最も顕著な制限のひとつを取り除いたり、 問題に気づいたりすることができます。

source: As mentioned above, you can select among the three execution models: imperative (like shown above), reactive (using the Mutiny API, including stream manipulation), or virtual threads:
ja_jp: 上記のとおり、命令型 (上記参照)、リアクティブ型 (ストリーム操作を含む Mutiny API を使用)、仮想スレッドの 3 つの実行モデルから選択できます。

source: As mentioned before, an extension is composed of two modules:
ja_jp: 前述したように、エクステンションは2つのモジュールで構成されています。

source: As mentioned earlier, the following claims are added automatically if they are not already set: `iat` (issued at), `exp` (expires at), `jti` (token identifier), `iss` (issuer), and `aud` (audience).
ja_jp: 前述のように、 `iat` (発行時刻)、 `exp` (有効期限)、 `jti` (トークン識別子)、 `iss` (発行者)、および `aud` (対象者) などのクレームは、まだ設定されていない場合は自動的に追加されます。

source: As mentioned in <4>, you need a deserializer that can create a `Fruit` from the record. This can be done using a Jackson deserializer:
ja_jp: <4> で述べたように、レコードから `Fruit` を作成できるデシリアライザーが必要です。 これは、Jackson デシリアライザーを使用して実行できます。

source: As mentioned in the <<tenant-properties>> section, when you configure OIDC tenants in `application.properties`, the tenant name is declared directly in the property name, for example, a `keycloak-realm-a` tenant is a 3rd token in the property name: `quarkus.oidc.keycloak-realm-a.auth-server-url=${keycloak-realm-a.url}`, etc.
ja_jp: <<tenant-properties>> セクションで述べたように、 `application.properties` で OIDC テナントを設定する場合、テナント名はプロパティー名の中に直接宣言されます。たとえば、 `keycloak-realm-a` テナントは、プロパティー名 `quarkus.oidc.keycloak-realm-a.auth-server-url=${keycloak-realm-a.url}` などの 3 番目のトークンです。

source: As mentioned in the new features section, requests are served on the event-loop threads by default. This ensures maximum throughput, but also means that no blocking work should be performed on these threads. If you use Blocking IO (for example by accessing a database with Hibernate Panache), be sure to use the `@Blocking` annotation on either the method or the class. This will ensure that the request will be served on a worker thread. It goes without saying that we are also very interested in hearing your feedback about this default.
ja_jp: 新機能のセクションで述べたように、デフォルトではリクエストはイベントループスレッド上で処理されます。これは最大のスループットを保証しますが、これらのスレッドでブロッキング作業を行うべきではないことも意味します。ブロッキング IO を使用する場合 (例えば、Hibernate Panache でデータベースにアクセスするなど)、メソッドまたはクラスのいずれかで `@Blocking` アノテーションを必ず使用してください。 これにより、リクエストがワーカースレッドで処理されるようになります。言うまでもなく、このデフォルトについてのフィードバックも非常に興味を持っています。

source: As mentioned in the xref:security-oidc-code-flow-authentication.adoc[OIDC code flow mechanism for protecting web applications] guide, ID and access tokens are returned after the authorization code flow has been completed, with some providers like `GitHub` returning an access token only. It is this access token that has to be propagated to services such as `Google Calendar`, or `Spotify Playlists` for the currently authenticated user to be able to use such services.
ja_jp: xref:security-oidc-code-flow-authentication.adoc[Web アプリケーションを保護するための OIDC コードフローメカニズム] ガイドに記載されているように、ID とアクセストークンは認可コードフローが完了した後に返されますが、 `GitHub` などの一部のプロバイダーはアクセストークンのみを返します。 現在認証されているユーザーが Google カレンダーや Spotify プレイリストなどのサービスを使用できるようにするには、このアクセストークンをこれらのサービスに伝播する必要があります。

source: As mentioned in the xref:why-not[Why not run everything on virtual threads?] section, the Java ecosystem is not entirely ready for virtual threads. So, you need to be careful, especially when using a libraries doing I/O.
ja_jp: xref:why-not[すべてを仮想スレッドで実行しない理由] セクションで述べたように、Java エコシステムは仮想スレッドに完全には対応していません。 したがって、特に I/O を実行するライブラリーを使用する場合は注意が必要です。

source: As mentioned, there are some other ways to create pages in Dev UI (other than using Web Components).
ja_jp: 前述のとおり、Dev UI でページを作成する方法は (Web コンポーネントを使用する以外にも) いくつかあります。

source: As mentioned, use `AccessTokenRequestFilter` if you work with Keycloak or an OpenID Connect Provider that supports a Token Exchange protocol.
ja_jp: 前述のように、Keycloak またはトークン交換プロトコルをサポートする OpenID Connect プロバイダーを使用する場合は、 `AccessTokenRequestFilter` を使用します。

source: As mentioned, use `AccessTokenRequestFilter` if you work with Keycloak or an OpenID Connect provider that supports a Token Exchange protocol.
ja_jp: 前述のように、Keycloak またはトークン交換プロトコルをサポートする OpenID Connect プロバイダーを使用する場合は、 `AccessTokenRequestFilter` を使用します。

source: As mentionned before, an extension is composed of two modules:
ja_jp: 前述したように、エクステンションは2つのモジュールで構成されています。

source: As much as possible Quarkus tries to avoid reflection, reducing startup time and memory usage. During the built-time processing, extensions can analyze the application code and the classes available on the classpath and replace reflection calls with regular invocations. The usage of dynamic proxies is also prevented by using generating custom proxy at build time.
ja_jp: Quarkus は可能な限りリフレクションを回避し、起動時間とメモリー使用量を削減します。ビルド時処理中に、エクステンションはアプリケーションコードとクラスパス上の利用可能なクラスを分析し、リフレクション呼び出しを通常の呼び出しに置き換えることができます。また、ビルド時にカスタムプロキシーを生成することで、動的プロキシーの使用も防止されます。

source: As much as possible favor doing work at build time (deployment part of the extension) as opposed to let the framework do work at startup time (runtime). The more is done there, the smaller Quarkus applications using that extension will be and the faster they will load.
ja_jp: 可能な限り、フレームワークに起動時（ランタイム）に作業をさせるのではなく、ビルド時（エクステンションのデプロイメント部分）に作業を行うことをお勧めします。そこでの作業が多いほど、そのエクステンションを使用しているQuarkusアプリケーションは小さくなり、ロードが速くなります。
